//-----------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------
//---Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.---
//-----------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------

// System.Console.WriteLine("Введите число");
// int a = Convert.ToInt32(Console.ReadLine()); // Число
// System.Console.WriteLine("Введите степень");
// int b = Convert.ToInt32(Console.ReadLine()); // Степень

// // Функция возводит число а в степень b
// void GetSqwr(int a, int b){    
//     int res = 1;
//     for (int i = 1; i <= b; i++)
//     {
//         res *= a;
//     }

//     System.Console.WriteLine(res);
// }
// GetSqwr(a, b);

//-----------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------
//-------------------Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.--------------------
//-----------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------

// int GetNum(string text){
//     System.Console.Write(text);
//     return Convert.ToInt32(Console.ReadLine());
// }

// void Account(int a){
//     int res = 0;
//     while(a != 0)
//     {
//         res += a%10;
//         a /= 10;
//     }
//     System.Console.WriteLine(res);
// }


// int num = GetNum("Введите число ");
// Account(num);


//-----------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------
//--------------Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.---------------
//-----------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------

int GetNum(string text){
    System.Console.WriteLine(text);
    return Convert.ToInt32(Console.ReadLine());
}

int[] Arr(int a){
    int[] arr = new int[a];
    System.Console.WriteLine("введите значение ");
    for (int i = 0; i < a; i++)
    {
        int b = Convert.ToInt32(Console.ReadLine());
        arr[i] = b;
    }
    return arr;
}


System.Console.WriteLine("[{0}]", String.Join(", ",Arr(GetNum("Введите длинну массива"))));

